<template>
  <div class="relative flex flex-col h-full  w-full font-deca">
    <div class="flex items-center justify-center mb-2">
      <div class="w-full max-w-sm overflow rounded-xl">
        <div class="relative py-2 px-4">
          <div class="w-full h-full flex items-center justify-center overflow-hidden">
            <img
              src="/profile.png"
              alt="Profile Avatar"
              class="w-32 h-32 object-cover rounded-full"
            />
          </div>

          <div class="text-center relative flex flex-col items-center justify-center">
            <h1 class="text-xl font-semibold  text-slate-950 mt-5 uppercase">Nevzat Kılınç</h1>
            <h1 class="text-sm font-light text-slate-500">Kurumsal İşbirliği Ortağınız</h1>

          </div>

          <div class="flex flex-wrap justify-center mt-8 gap-5">
            <div class="basis-1/4 flex justify-center">
              <div class="border border-gray-200 w-24 h-24 flex flex-col items-center justify-center space-y-1 rounded-3xl
              bg-[#99f]/10 backdrop-blur-xs shadow-[0_0px_7px_rgba(0,0,0,0.30)]">
                <svg class="h-8 " width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <g clip-path="url(#clip0_9_5404)">
                  <path d="M16.3332 15.75H19.2498L20.4165 11.0833H16.3332V8.74998C16.3332 7.54831 16.3332 6.41665 18.6665 6.41665H20.4165V2.49665C20.0362 2.44648 18.6 2.33331 17.0833 2.33331C13.9158 2.33331 11.6665 4.26648 11.6665 7.81665V11.0833H8.1665V15.75H11.6665V25.6666H16.3332V15.75Z" fill="#4267B2"/>
                  </g>
                  <defs>
                  <clipPath id="clip0_9_5404">
                  <rect width="28" height="28" fill="white"/>
                  </clipPath>
                  </defs>
                 </svg>
                 <span class="text-xs font-semibold text-[#4267B2]">Facebook</span>
              </div>
            </div>
            <div class="basis-1/4 flex justify-center">
              <div class="w-24 h-24 flex flex-col items-center justify-center space-y-1 rounded-3xl
               bg-[#999]/10 backdrop-blur-xs shadow-[0_0px_7px_rgba(0,0,0,0.50)]">
                <svg class="h-8 rounded-md" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_205_196)">
                <path d="M32 0H0V32H32V0Z" fill="url(#paint0_radial_205_196)"/>
                <path d="M32 0H0V32H32V0Z" fill="url(#paint1_radial_205_196)"/>
                <path d="M16 6.98795C18.9157 6.98795 19.3133 6.98795 20.506 6.98795C21.5663 6.98795 22.0964 7.25301 22.494 7.38554C23.0241 7.6506 23.4217 7.78313 23.8193 8.18072C24.2169 8.57831 24.4819 8.9759 24.6145 9.50603C24.747 9.90362 24.8795 10.4337 25.012 11.494C25.012 12.6867 25.012 12.9518 25.012 16C25.012 19.0482 25.012 19.3133 25.012 20.506C25.012 21.5663 24.747 22.0964 24.6145 22.494C24.3494 23.0241 24.2169 23.4217 23.8193 23.8193C23.4217 24.2169 23.0241 24.4819 22.494 24.6145C22.0964 24.747 21.5663 24.8795 20.506 25.012C19.3133 25.012 19.0482 25.012 16 25.012C12.9518 25.012 12.6867 25.012 11.494 25.012C10.4337 25.012 9.90362 24.747 9.50603 24.6145C8.9759 24.3494 8.57831 24.2169 8.18072 23.8193C7.78313 23.4217 7.51807 23.0241 7.38554 22.494C7.25301 22.0964 7.12048 21.5663 6.98795 20.506C6.98795 19.3133 6.98795 19.0482 6.98795 16C6.98795 12.9518 6.98795 12.6867 6.98795 11.494C6.98795 10.4337 7.25301 9.90362 7.38554 9.50603C7.6506 8.9759 7.78313 8.57831 8.18072 8.18072C8.57831 7.78313 8.9759 7.51807 9.50603 7.38554C9.90362 7.25301 10.4337 7.12048 11.494 6.98795C12.6867 6.98795 13.0843 6.98795 16 6.98795ZM16 5C12.9518 5 12.6867 5 11.494 5C10.3012 5 9.50603 5.26506 8.84337 5.53012C8.18072 5.79518 7.51807 6.19277 6.85542 6.85542C6.19277 7.51807 5.92771 8.04819 5.53012 8.84337C5.26506 9.50603 5.13253 10.3012 5 11.494C5 12.6867 5 13.0843 5 16C5 19.0482 5 19.3133 5 20.506C5 21.6988 5.26506 22.494 5.53012 23.1566C5.79518 23.8193 6.19277 24.4819 6.85542 25.1446C7.51807 25.8072 8.04819 26.0723 8.84337 26.4699C9.50603 26.7349 10.3012 26.8675 11.494 27C12.6867 27 13.0843 27 16 27C18.9157 27 19.3133 27 20.506 27C21.6988 27 22.494 26.7349 23.1566 26.4699C23.8193 26.2048 24.4819 25.8072 25.1446 25.1446C25.8072 24.4819 26.0723 23.9518 26.4699 23.1566C26.7349 22.494 26.8675 21.6988 27 20.506C27 19.3133 27 18.9157 27 16C27 13.0843 27 12.6867 27 11.494C27 10.3012 26.7349 9.50603 26.4699 8.84337C26.2048 8.18072 25.8072 7.51807 25.1446 6.85542C24.4819 6.19277 23.9518 5.92771 23.1566 5.53012C22.494 5.26506 21.6988 5.13253 20.506 5C19.3133 5 19.0482 5 16 5Z" fill="white"/>
                <path d="M16 10.3012C12.8193 10.3012 10.3012 12.8193 10.3012 16C10.3012 19.1807 12.8193 21.6988 16 21.6988C19.1807 21.6988 21.6988 19.1807 21.6988 16C21.6988 12.8193 19.1807 10.3012 16 10.3012ZM16 19.7108C14.012 19.7108 12.2892 18.1205 12.2892 16C12.2892 14.012 13.8795 12.2892 16 12.2892C17.988 12.2892 19.7108 13.8795 19.7108 16C19.7108 17.988 17.988 19.7108 16 19.7108Z" fill="white"/>
                <path d="M21.8313 11.494C22.5633 11.494 23.1566 10.9006 23.1566 10.1687C23.1566 9.43673 22.5633 8.84337 21.8313 8.84337C21.0994 8.84337 20.506 9.43673 20.506 10.1687C20.506 10.9006 21.0994 11.494 21.8313 11.494Z" fill="white"/>
                </g>
                <rect x="0.5" y="0.5" width="31" height="31" rx="3.5" stroke="black" stroke-opacity="0.1"/>
                <defs>
                <radialGradient id="paint0_radial_205_196" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(9 43.5) rotate(-80.4258) scale(42.0862)">
                <stop stop-color="#FFDD55"/>
                <stop stop-color="#FFDD55"/>
                <stop offset="0.517936" stop-color="#FF442C"/>
                <stop offset="1" stop-color="#FF1ED2"/>
                </radialGradient>
                <radialGradient id="paint1_radial_205_196" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(6.66667 -2) rotate(77.1957) scale(15.0407 41.7941)">
                <stop offset="0.096473" stop-color="#7000C9"/>
                <stop offset="0.408416" stop-color="#9A00E2" stop-opacity="0.723958"/>
                <stop offset="0.975495" stop-color="#AD00FF" stop-opacity="0"/>
                </radialGradient>
                <clipPath id="clip0_205_196">
                <rect width="32" height="32" rx="4" fill="white"/>
                </clipPath>
                </defs>
                </svg>
                 <span class="text-xs font-semibold text-[#D2525E]">instagram</span>
              </div>
            </div>
            <div class="basis-1/4 flex justify-center">
              <div class="border border-gray-200 w-24 h-24 flex flex-col items-center justify-center rounded-3xl
              bg-[#99f]/10 backdrop-blur-xs shadow-[0_0px_7px_rgba(0,0,0,0.30)]">
                <svg class="h-8" width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <g clip-path="url(#clip0_9_5407)">
                  <path d="M25.8559 6.59864C24.9652 6.99262 24.0206 7.25136 23.0535 7.36631C24.0729 6.75665 24.8358 5.79716 25.2002 4.66664C24.2435 5.23598 23.1947 5.63498 22.1015 5.85081C21.3672 5.06515 20.3939 4.5441 19.333 4.36866C18.272 4.19322 17.1828 4.37321 16.2347 4.88067C15.2865 5.38813 14.5326 6.19461 14.0902 7.17473C13.6477 8.15486 13.5414 9.25372 13.7878 10.3005C11.8478 10.2032 9.9499 9.69909 8.21735 8.82075C6.4848 7.94241 4.95633 6.70953 3.73118 5.20214C3.29752 5.947 3.06963 6.79374 3.07085 7.65564C3.07085 9.34731 3.93185 10.8418 5.24085 11.7168C4.46619 11.6924 3.70859 11.4832 3.03118 11.1066V11.1673C3.03142 12.294 3.42128 13.3859 4.13467 14.2579C4.84806 15.1299 5.84108 15.7284 6.94535 15.9518C6.22623 16.1467 5.47221 16.1754 4.74035 16.0358C5.0517 17.0056 5.65852 17.8537 6.47587 18.4614C7.29322 19.0692 8.28017 19.4061 9.29852 19.425C8.28641 20.2199 7.12756 20.8075 5.88821 21.1542C4.64886 21.5009 3.35333 21.5999 2.07568 21.4456C4.306 22.88 6.9023 23.6415 9.55402 23.639C18.5292 23.639 23.4374 16.2038 23.4374 9.75564C23.4374 9.54564 23.4315 9.33331 23.4222 9.12564C24.3775 8.43517 25.202 7.57983 25.857 6.59981L25.8559 6.59864Z" fill="#1DA1F2"/>
                  </g>
                  <defs>
                  <clipPath id="clip0_9_5407">
                  <rect width="28" height="28" fill="white"/>
                  </clipPath>
                  </defs>
                  </svg>
                  <span class="text-xs font-semibold text-[#1DA1F2]">Twitter</span>
              </div>
            </div>
            <div class="basis-1/4 flex justify-center">
              <div class=" w-24 h-24 flex flex-col items-center justify-center space-y-1 rounded-3xl
              bg-[#999]/10 backdrop-blur-xs shadow-[0_0px_7px_rgba(0,0,0,0.50)]">
                <svg class="h-8" width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M26.833 11.3286C26.8907 9.65865 26.5255 8.00125 25.7713 6.51023C25.2596 5.89842 24.5495 5.48555 23.7647 5.34356C20.5185 5.0482 17.2588 4.92747 13.9997 4.98189C10.7524 4.92705 7.50456 5.04388 4.26966 5.33189C3.63012 5.44823 3.03827 5.74821 2.56633 6.19523C1.51633 7.16356 1.39966 8.82023 1.28299 10.2202C1.1127 12.7373 1.1127 15.2631 1.28299 17.7802C1.31718 18.5682 1.4345 19.3503 1.63299 20.1136C1.77367 20.7028 2.05827 21.248 2.46133 21.7002C2.93647 22.1709 3.54211 22.488 4.19966 22.6102C6.71483 22.9214 9.24924 23.0501 11.783 22.9952C15.8663 23.0536 19.448 22.9952 23.683 22.6686C24.3562 22.5524 24.9785 22.2352 25.468 21.7586C25.7943 21.4315 26.0382 21.0317 26.1797 20.5919C26.5965 19.3115 26.8014 17.9717 26.7863 16.6252C26.833 15.9719 26.833 12.0286 26.833 11.3286ZM11.363 17.3252V10.1036L18.2697 13.7319C16.333 14.8052 13.778 16.0186 11.363 17.3252Z" fill="#FF0000"/>
                  </svg>
                <span class="text-xs font-semibold text-[#FF0000]">Youtube</span>
             </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
